zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_v2.c
/*
 * Copyright (c) 2016 BayLibre, SAS
 * Copyright (c) 2017 Linaro Ltd
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * I2C Driver for: STM32F0, STM32F3, STM32F7, STM32L0, STM32L4, STM32WB and
 * STM32WL
 *
 */

#include <zephyr/cache.h>
#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/dt-bindings/memory-attr/memory-attr-arm.h>
#include <zephyr/kernel.h>
#include <zephyr/linker/linker-defs.h>
#include <zephyr/logging/log.h>
#include <zephyr/mem_mgmt/mem_attr.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include <zephyr/sys/util.h>

#include <soc.h>
#include <stm32_bitops.h>
#include <stm32_cache.h>
#include <stm32_ll_i2c.h>

#include <errno.h>

#include "i2c_stm32.h"
#include "i2c-priv.h"

LOG_MODULE_REGISTER(i2c_ll_stm32_v2, CONFIG_I2C_LOG_LEVEL);

#if CONFIG_STM32_HAL2
#define STM32_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period) \
	LL_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period)
#else /* CONFIG_STM32_HAL2 */
#define STM32_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period) \
	__LL_I2C_CONVERT_TIMINGS(prescaler, setup_time, hold_time, sclh_period, scll_period)
#endif /* CONFIG_STM32_HAL2 */

#ifdef CONFIG_I2C_STM32_V2_TIMING
/* Use the algorithm to calculate the I2C timing */
#ifndef I2C_STM32_VALID_TIMING_NBR
#define I2C_STM32_VALID_TIMING_NBR                 128U
#endif
#define I2C_STM32_SPEED_FREQ_STANDARD                0U    /* 100 kHz */
#define I2C_STM32_SPEED_FREQ_FAST                    1U    /* 400 kHz */
#define I2C_STM32_SPEED_FREQ_FAST_PLUS               2U    /* 1 MHz */
#define I2C_STM32_ANALOG_FILTER_DELAY_MIN            50U   /* ns */
#define I2C_STM32_ANALOG_FILTER_DELAY_MAX            260U  /* ns */
#define I2C_STM32_USE_ANALOG_FILTER                  1U
#define I2C_STM32_DIGITAL_FILTER_COEF                0U
#define I2C_STM32_PRESC_MAX                          16U
#define I2C_STM32_SCLDEL_MAX                         16U
#define I2C_STM32_SDADEL_MAX                         16U
#define I2C_STM32_SCLH_MAX                           256U
#define I2C_STM32_SCLL_MAX                           256U

/* I2C_DEVICE_Private_Types */
struct i2c_stm32_charac_t {
	uint32_t freq;       /* Frequency in Hz */
	uint32_t freq_min;   /* Minimum frequency in Hz */
	uint32_t freq_max;   /* Maximum frequency in Hz */
	uint32_t hddat_min;  /* Minimum data hold time in ns */
	uint32_t vddat_max;  /* Maximum data valid time in ns */
	uint32_t sudat_min;  /* Minimum data setup time in ns */
	uint32_t lscl_min;   /* Minimum low period of the SCL clock in ns */
	uint32_t hscl_min;   /* Minimum high period of SCL clock in ns */
	uint32_t trise;      /* Rise time in ns */
	uint32_t tfall;      /* Fall time in ns */
	uint32_t dnf;        /* Digital noise filter coefficient */
};

struct i2c_stm32_timings_t {
	uint32_t presc;      /* Timing prescaler */
	uint32_t tscldel;    /* SCL delay */
	uint32_t tsdadel;    /* SDA delay */
	uint32_t sclh;       /* SCL high period */
	uint32_t scll;       /* SCL low period */
};

/* I2C_DEVICE Private Constants */
static const struct i2c_stm32_charac_t i2c_stm32_charac[] = {
	[I2C_STM32_SPEED_FREQ_STANDARD] = {
		.freq = 100000,
		.freq_min = 80000,
		.freq_max = 120000,
		.hddat_min = 0,
		.vddat_max = 3450,
		.sudat_min = 250,
		.lscl_min = 4700,
		.hscl_min = 4000,
		.trise = 640,
		.tfall = 20,
		.dnf = I2C_STM32_DIGITAL_FILTER_COEF,
	},
	[I2C_STM32_SPEED_FREQ_FAST] = {
		.freq = 400000,
		.freq_min = 320000,
		.freq_max = 480000,
		.hddat_min = 0,
		.vddat_max = 900,
		.sudat_min = 100,
		.lscl_min = 1300,
		.hscl_min = 600,
		.trise = 250,
		.tfall = 100,
		.dnf = I2C_STM32_DIGITAL_FILTER_COEF,
	},
	[I2C_STM32_SPEED_FREQ_FAST_PLUS] = {
		.freq = 1000000,
		.freq_min = 800000,
		.freq_max = 1200000,
		.hddat_min = 0,
		.vddat_max = 450,
		.sudat_min = 50,
		.lscl_min = 500,
		.hscl_min = 260,
		.trise = 60,
		.tfall = 100,
		.dnf = I2C_STM32_DIGITAL_FILTER_COEF,
	},
};

static struct i2c_stm32_timings_t i2c_valid_timing[I2C_STM32_VALID_TIMING_NBR];
static uint32_t i2c_valid_timing_nbr;
#endif /* CONFIG_I2C_STM32_V2_TIMING */

#define I2C_STM32_WAIT_POLL_SLEEP_USEC 10U

#if defined(CONFIG_I2C_TARGET)
static inline int wait_bus_idle(const struct device *dev, uint32_t timeout_us)
{
	const struct i2c_stm32_config *cfg = dev->config;
	I2C_TypeDef *i2c = cfg->i2c;
	k_timepoint_t end = sys_timepoint_calc(K_USEC(timeout_us));

	/* Called from synchronous transfer path only (thread context). */
	__ASSERT_NO_MSG(!k_is_in_isr());

	while (LL_I2C_IsActiveFlag_BUSY(i2c)) {
		if (sys_timepoint_expired(end)) {
			return -EBUSY;
		}

		(void)k_usleep(I2C_STM32_WAIT_POLL_SLEEP_USEC);
	}

	return 0;
}
#endif /* CONFIG_I2C_TARGET */

__maybe_unused static bool using_dma(struct i2c_stm32_data *dev_data __maybe_unused)
{
#ifdef CONFIG_I2C_STM32_V2_DMA
	return dev_data->use_dma;
#else
	return false;
#endif /* CONFIG_I2C_STM32_V2_DMA */
}

#ifdef CONFIG_I2C_STM32_V2_DMA
static int configure_dma(struct stream const *dma, struct dma_config *dma_cfg,
			 struct dma_block_config *blk_cfg)
{
	if (!device_is_ready(dma->dev_dma)) {
		LOG_ERR("DMA device not ready");
		return -ENODEV;
	}

	dma_cfg->head_block = blk_cfg;
	dma_cfg->block_count = 1;

	int ret = dma_config(dma->dev_dma, dma->dma_channel, dma_cfg);

	if (ret != 0) {
		LOG_ERR("Problem setting up DMA: %d", ret);
		return ret;
	}

	ret = dma_start(dma->dev_dma, dma->dma_channel);

	if (ret != 0) {
		LOG_ERR("Problem starting DMA: %d", ret);
		return ret;
	}

	return 0;
}

static int dma_xfer_start(const struct device *dev, struct i2c_msg *msg)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	int ret = 0;

	if ((msg->flags & I2C_MSG_READ) != 0U) {
		/* Configure RX DMA */
		data->dma_blk_cfg.source_address = LL_I2C_DMA_GetRegAddr(
			cfg->i2c, LL_I2C_DMA_REG_DATA_RECEIVE);
		data->dma_blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
		data->dma_blk_cfg.dest_address = (uint32_t)data->current.buf;
		data->dma_blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;
		data->dma_blk_cfg.block_size = data->current.len;

		ret = configure_dma(&cfg->rx_dma, &data->dma_rx_cfg, &data->dma_blk_cfg);
		if (ret != 0) {
			return ret;
		}
		LL_I2C_EnableDMAReq_RX(i2c);
	} else {
		if (data->current.len != 0U) {
			/* Configure TX DMA */
			data->dma_blk_cfg.source_address = (uint32_t)data->current.buf;
			data->dma_blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
			data->dma_blk_cfg.dest_address = LL_I2C_DMA_GetRegAddr(
				cfg->i2c, LL_I2C_DMA_REG_DATA_TRANSMIT);
			data->dma_blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
			data->dma_blk_cfg.block_size = data->current.len;

			ret = configure_dma(&cfg->tx_dma, &data->dma_tx_cfg, &data->dma_blk_cfg);
			if (ret != 0) {
				return ret;
			}
			LL_I2C_EnableDMAReq_TX(i2c);
		}
	}
	return 0;
}

static void dma_finish(const struct device *dev, struct i2c_msg *msg)
{
	const struct i2c_stm32_config *cfg = dev->config;

	if ((msg->flags & I2C_MSG_READ) != 0U) {
		dma_stop(cfg->rx_dma.dev_dma, cfg->rx_dma.dma_channel);
		LL_I2C_DisableDMAReq_RX(cfg->i2c);
		if (!stm32_buf_in_nocache((uintptr_t)msg->buf, msg->len)) {
			sys_cache_data_invd_range(msg->buf, msg->len);
		}
	} else {
		dma_stop(cfg->tx_dma.dev_dma, cfg->tx_dma.dma_channel);
		LL_I2C_DisableDMAReq_TX(cfg->i2c);
	}
}
#endif /* CONFIG_I2C_STM32_V2_DMA */

