zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_v2.c
#ifdef CONFIG_I2C_STM32_INTERRUPT
static inline void i2c_stm32_signal_xfer_done(const struct device *dev)
{
	struct i2c_stm32_data *data = dev->data;

	if (data->current.msg == NULL) {
		return;
	}

	data->current.msg = NULL;
	k_sem_give(&data->device_sync_sem);
}

static void i2c_stm32_disable_transfer_interrupts(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

	LL_I2C_DisableIT_TX(i2c);
	LL_I2C_DisableIT_RX(i2c);
	LL_I2C_DisableIT_STOP(i2c);
	LL_I2C_DisableIT_NACK(i2c);
	LL_I2C_DisableIT_TC(i2c);

	if (!data->smbalert_active) {
		LL_I2C_DisableIT_ERR(i2c);
	}
}

#if defined(CONFIG_I2C_TARGET)
static inline void i2c_stm32_clear_controller_request(I2C_TypeDef *i2c)
{
	unsigned int key = irq_lock();

	/* Errata 2.19.3/2.19.4: clear any pending controller request so it
	 * cannot restart after own-address recognition.
	 */
	stm32_reg_clear_bits(&i2c->CR2, I2C_CR2_START | I2C_CR2_STOP);
	irq_unlock(key);
}

static struct i2c_target_config *i2c_stm32_target_cfg_get(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	struct i2c_target_config *target_cfg = NULL;

	if (data->target_cfg != NULL) {
		/**
		 * Target1 is configured and could be in 7- or 10-bit mode.
		 * If 10-bit mode is enabled, Target2 cannot be in use because
		 * it only supports 7-bit mode, so we know which cfg is matched.
		 * If 7-bit mode is enabled, find the correct cfg based on
		 * the I2C address sent by bus controller.
		 */
		if ((data->target_cfg->flags & I2C_TARGET_FLAGS_ADDR_10_BITS) != 0) {
			target_cfg = data->target_cfg;
		} else {
			uint8_t target_address;

			/* Choose the right target from the address match code */
			target_address = LL_I2C_GetAddressMatchCode(i2c) >> 1;
			if (target_address == data->target_cfg->address) {
				target_cfg = data->target_cfg;
			} else if (data->target2_cfg != NULL &&
				   target_address == data->target2_cfg->address) {
				target_cfg = data->target2_cfg;
			}
		}
	} else {
		/**
		 * If we received an event but Target1 is not configured,
		 * then Target2 should be the target for the event.
		 */
		target_cfg = data->target2_cfg;
	}

	if (target_cfg == NULL) {
		__ASSERT_NO_MSG(0);
		return NULL;
	}

	return target_cfg;
}

static void i2c_stm32_target_addr_setup(const struct device *dev,
					struct i2c_target_config *target_cfg, bool clear_addr)
{
	const struct i2c_stm32_config *cfg = dev->config;
	I2C_TypeDef *i2c = cfg->i2c;
	const struct i2c_target_callbacks *target_cb = target_cfg->callbacks;
	uint32_t dir;

	if (clear_addr) {
		LL_I2C_ClearFlag_ADDR(i2c);
	}

	dir = LL_I2C_GetTransferDirection(i2c);
	if (dir == LL_I2C_DIRECTION_WRITE) {
		if (target_cb->write_requested(target_cfg) < 0) {
			LOG_ERR("Error initiating writing");
		} else {
			LL_I2C_EnableIT_RX(i2c);
		}
	} else {
		uint8_t val;

		if (target_cb->read_requested(target_cfg, &val) < 0) {
			LOG_ERR("Error initiating reading");
		} else {
			LL_I2C_TransmitData8(i2c, val);
			LL_I2C_EnableIT_TX(i2c);
		}
	}

	LL_I2C_EnableIT_STOP(i2c);
	LL_I2C_EnableIT_NACK(i2c);
	LL_I2C_EnableIT_TC(i2c);
	LL_I2C_EnableIT_ERR(i2c);
}

static void i2c_stm32_controller_abort_to_target(const struct device *dev, bool own_addr_match)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;

	if (own_addr_match) {
		LL_I2C_ClearFlag_ADDR(cfg->i2c);
		i2c_stm32_clear_controller_request(cfg->i2c);
	}

	i2c_stm32_disable_transfer_interrupts(dev);
#ifdef CONFIG_I2C_STM32_V2_DMA
	if (using_dma(data)) {
		LL_I2C_DisableDMAReq_RX(cfg->i2c);
		LL_I2C_DisableDMAReq_TX(cfg->i2c);
	}
#endif
	LL_I2C_ClearFlag_TXE(cfg->i2c);
	data->controller_active = false;
	i2c_stm32_signal_xfer_done(dev);
}

static void i2c_stm32_target_event(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	I2C_TypeDef *i2c = cfg->i2c;
	struct i2c_target_config *target_cfg = i2c_stm32_target_cfg_get(dev);
	const struct i2c_target_callbacks *target_cb;

	if (target_cfg == NULL) {
		return;
	}

	target_cb = target_cfg->callbacks;

	if (LL_I2C_IsActiveFlag_TXIS(i2c)) {
		uint8_t val = 0x00;
		int ret = target_cb->read_processed(target_cfg, &val);

		/* We should transmit the data before logging because logging could
		 * lead the i2c target to stretch the clock if the data are not
		 * transmitted fast enough.
		 */
		LL_I2C_TransmitData8(i2c, val);
		if (ret < 0) {
			LOG_ERR("Error continuing reading");
		}

		return;
	}

	if (LL_I2C_IsActiveFlag_RXNE(i2c)) {
		uint8_t val = LL_I2C_ReceiveData8(i2c);

		if (target_cb->write_received(target_cfg, val)) {
			LL_I2C_AcknowledgeNextData(i2c, LL_I2C_NACK);
		}
		return;
	}

	if (LL_I2C_IsActiveFlag_NACK(i2c)) {
		LL_I2C_ClearFlag_NACK(i2c);
	}

	if (LL_I2C_IsActiveFlag_STOP(i2c)) {
		i2c_stm32_disable_transfer_interrupts(dev);

		/* Flush remaining TX byte before clearing Stop Flag */
		LL_I2C_ClearFlag_TXE(i2c);

		LL_I2C_ClearFlag_STOP(i2c);

		target_cb->stop(target_cfg);

		/* Prepare to ACK next transmissions address byte */
		LL_I2C_AcknowledgeNextData(i2c, LL_I2C_ACK);
	}

	if (LL_I2C_IsActiveFlag_ADDR(i2c)) {
		i2c_stm32_target_addr_setup(dev, target_cfg, true);
	}
}

static bool i2c_stm32_target_preempt_controller_event(const struct device *dev, uint32_t isr)
{
	struct i2c_stm32_data *data = dev->data;
	struct i2c_target_config *target_cfg;

	if (!data->target_attached) {
		return false;
	}

	if (data->controller_active && ((isr & I2C_ISR_ADDR) != 0U)) {
		target_cfg = i2c_stm32_target_cfg_get(dev);
		if (target_cfg == NULL) {
			return true;
		}

		data->current.is_arlo = 1U;
		i2c_stm32_controller_abort_to_target(dev, true);
		i2c_stm32_target_addr_setup(dev, target_cfg, false);
		return true;
	}

	if (!data->controller_active) {
		i2c_stm32_target_event(dev);
		return true;
	}

	return false;
}

/* Attach and start I2C as target */
int i2c_stm32_target_register(const struct device *dev,
			      struct i2c_target_config *config)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t bitrate_cfg;
	int ret;

	if (!config) {
		return -EINVAL;
	}

	if (data->target_cfg && data->target2_cfg) {
		return -EBUSY;
	}

	if (data->controller_active) {
		return -EBUSY;
	}

	bitrate_cfg = i2c_map_dt_bitrate(cfg->bitrate);

	k_sem_take(&data->bus_mutex, K_FOREVER);
	ret = i2c_stm32_runtime_configure(dev, bitrate_cfg);
	k_sem_give(&data->bus_mutex);

	if (ret < 0) {
		LOG_ERR("i2c: failure initializing");
		return ret;
	}

	/* Mark device as active */
	ret = pm_device_runtime_get(dev);
	if (ret < 0) {
		LOG_ERR_PM_DEVICE_RUNTIME_GET(dev, ret);
		return ret;
	}

