zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_v2.c
#if defined(I2C_CR1_WUPEN)
	if (pm_device_wakeup_is_capable(dev)) {
		/* Enable wake-up from stop */
		LOG_DBG("i2c: enabling wakeup from stop");
		LL_I2C_EnableWakeUpFromStop(cfg->i2c);
	}
#endif /* I2C_CR1_WUPEN */

	LL_I2C_Enable(i2c);

	if (!data->target_cfg) {
		data->target_cfg = config;
		if ((data->target_cfg->flags & I2C_TARGET_FLAGS_ADDR_10_BITS) != 0) {
			LL_I2C_SetOwnAddress1(i2c, config->address, LL_I2C_OWNADDRESS1_10BIT);
			LOG_DBG("i2c: target #1 registered with 10-bit address");
		} else {
			LL_I2C_SetOwnAddress1(i2c, config->address << 1U, LL_I2C_OWNADDRESS1_7BIT);
			LOG_DBG("i2c: target #1 registered with 7-bit address");
		}

		LL_I2C_EnableOwnAddress1(i2c);

		LOG_DBG("i2c: target #1 registered");
	} else {
		if ((config->flags & I2C_TARGET_FLAGS_ADDR_10_BITS) != 0) {
			(void)pm_device_runtime_put(dev);
			return -EINVAL;
		}

		data->target2_cfg = config;

		LL_I2C_SetOwnAddress2(i2c, config->address << 1U,
				      LL_I2C_OWNADDRESS2_NOMASK);
		LL_I2C_EnableOwnAddress2(i2c);
		LOG_DBG("i2c: target #2 registered");
	}

	data->target_attached = true;

	LL_I2C_EnableIT_ADDR(i2c);

	return 0;
}

int i2c_stm32_target_unregister(const struct device *dev,
				struct i2c_target_config *config)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

	if (!data->target_attached) {
		return -EINVAL;
	}

	if (data->controller_active) {
		return -EBUSY;
	}

	if (config == data->target_cfg) {
		LL_I2C_DisableOwnAddress1(i2c);
		data->target_cfg = NULL;

		LOG_DBG("i2c: target #1 unregistered");
	} else if (config == data->target2_cfg) {
		LL_I2C_DisableOwnAddress2(i2c);
		data->target2_cfg = NULL;

		LOG_DBG("i2c: target #2 unregistered");
	} else {
		return -EINVAL;
	}

	/* Return if there is a target remaining */
	if (data->target_cfg || data->target2_cfg) {
		(void)pm_device_runtime_put(dev);
		LOG_DBG("i2c: target#%c still registered", data->target_cfg?'1':'2');
		return 0;
	}

	/* Otherwise disable I2C */
	LL_I2C_DisableIT_ADDR(i2c);
	i2c_stm32_disable_transfer_interrupts(dev);

	LL_I2C_ClearFlag_NACK(i2c);
	LL_I2C_ClearFlag_STOP(i2c);
	LL_I2C_ClearFlag_ADDR(i2c);

	if (!data->smbalert_active) {
		LL_I2C_Disable(i2c);
	}

#if defined(I2C_CR1_WUPEN)
	if (pm_device_wakeup_is_capable(dev)) {
		/* Disable wake-up from STOP */
		LOG_DBG("i2c: disabling wakeup from stop");
		LL_I2C_DisableWakeUpFromStop(i2c);
	}
#endif /* I2C_CR1_WUPEN */

	/* Release the device */
	(void)pm_device_runtime_put(dev);

	data->target_attached = false;

	return 0;
}
#endif /* defined(CONFIG_I2C_TARGET) */

void i2c_stm32_event(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *regs = cfg->i2c;
	uint32_t isr = stm32_reg_read(&regs->ISR);
	const uint32_t cr1 = stm32_reg_read(&regs->CR1);

#if defined(CONFIG_I2C_TARGET)
	if (i2c_stm32_target_preempt_controller_event(dev, isr) == true) {
		return;
	}
#endif

	if ((isr & I2C_ISR_NACKF) != 0U) {
		/* NACK received, a STOP will automatically be sent */
		LL_I2C_ClearFlag_NACK(regs);
		data->current.is_nack = 1U;

	} else if ((isr & I2C_ISR_STOPF) != 0U) {
		/* STOP detected, either caused by automatic STOP after NACK or
		 * by request below in transfer complete
		 */
		/* Acknowledge stop condition */
		LL_I2C_ClearFlag_STOP(regs);
		/* Flush I2C controller TX buffer */
		LL_I2C_ClearFlag_TXE(regs);
		goto irq_xfer_completed;

	} else if ((isr & I2C_ISR_RXNE) != 0U) {
		__ASSERT_NO_MSG(data->current.len != 0U);
		*data->current.buf = LL_I2C_ReceiveData8(regs);
		data->current.len--;
		data->current.buf++;

	} else if (((isr & I2C_ISR_TCR) != 0U) && ((cr1 & I2C_CR1_TCIE) != 0U)) {
		/* Transfer complete with reload flag set means more data shall be transferred
		 * in same direction (No RESTART or STOP)
		 */
		uint32_t cr2 = stm32_reg_read(&regs->CR2);

		if (using_dma(data)) {
			/* Get number of bytes bytes transferred by DMA */
			uint32_t xfer_len = (cr2 & I2C_CR2_NBYTES_Msk) >> I2C_CR2_NBYTES_Pos;

			data->current.len -= xfer_len;
			data->current.buf += xfer_len;
		}

		if (data->current.len == 0U) {
			/* In this state all data from current message is transferred
			 * and that reload was used indicates that next message will
			 * contain more data in the same direction
			 * So keep reload turned on and let thread continue with next message
			 */
			goto irq_xfer_completed;
		} else if (data->current.len > 255U) {
			/* More data exceeding I2C controllers maximum single transfer length
			 * remaining in current message
			 * Keep RELOAD mode and set NBYTES to 255 again
			 */
			stm32_reg_write(&regs->CR2, cr2);
		} else {
			/* Data for a single transfer remains in buffer, set its length and
			 * - If more messages follow and transfer direction for next message is
			 *   same, keep reload on
			 * - If direction changes or current message is the last,
			 *   end reload mode and wait for TC
			 */
			cr2 &= ~I2C_CR2_NBYTES_Msk;
			cr2 |= data->current.len << I2C_CR2_NBYTES_Pos;
			/* If no more message data remains to be sent in current direction */
			if (!data->current.continue_in_next) {
				/* Disable reload mode, expect I2C_ISR_TC next */
				cr2 &= ~I2C_CR2_RELOAD;
			}
			stm32_reg_write(&regs->CR2, cr2);
		}

	} else if ((isr & I2C_ISR_TXIS) != 0U) {
		__ASSERT_NO_MSG(data->current.len != 0U);
		LL_I2C_TransmitData8(regs, *data->current.buf);
		data->current.len--;
		data->current.buf++;

	} else if (((isr & I2C_ISR_TC) != 0U) && ((cr1 & I2C_CR1_TCIE) != 0U)) {
		/* Transfer Complete, (I2C_ISR_TC is set) no reload this time so either do
		 * stop now or restart in thread
		 */

		/* Send stop if flag set in message */
		if ((data->current.msg->flags & I2C_MSG_STOP) != 0U) {
			/* Setting STOP here will clear TC, expect I2C_ISR_STOPF next */
			LL_I2C_GenerateStopCondition(regs);
		} else {
			/* Keep TC set and handover to thread for restart */
			goto irq_xfer_completed;
		}
	} else {
		/* Should not happen unless interrupt is shared */
		__ASSERT_NO_MSG(IS_ENABLED(CONFIG_SHARED_INTERRUPTS));
	}

	/* Make a dummy read from ISR to ensure we don't return before
	 * i2c controller had a chance to clear its interrupt flags due
	 * to bus delays
	 */
	(void)stm32_reg_read(&regs->ISR);
	return;

irq_xfer_completed:
	/* Disable IRQ:s involved in data transfer */
	i2c_stm32_disable_transfer_interrupts(dev);
	/* Wakeup thread */
	i2c_stm32_signal_xfer_done(dev);
}

int i2c_stm32_error(const struct device *dev)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

#if defined(CONFIG_I2C_TARGET)
	i2c_target_error_cb_t error_cb = NULL;

	if (data->target_attached && !data->controller_active &&
	    data->target_cfg != NULL && data->target_cfg->callbacks != NULL) {
		error_cb = data->target_cfg->callbacks->error;
	}
#endif

	if (LL_I2C_IsActiveFlag_ARLO(i2c)) {
		LL_I2C_ClearFlag_ARLO(i2c);
		data->current.is_arlo = 1U;
#if defined(CONFIG_I2C_TARGET)
		if (error_cb != NULL) {
			error_cb(data->target_cfg, I2C_ERROR_ARBITRATION);
		}
#endif
		goto end;
	}

	/* Address "Spurious Bus Error detection in controller mode"
	 * erratum, that affects STM32 I2C v2 controller, referenced
	 * in multiple errata sheets document like:
	 * - ES0392 (STM32H74x/75x), Rev 15, section 2.19.4
	 *
	 * Workaround: clear the BERR flag and let the ongoing
	 * transfer continue. If a real bus error has occurred,
	 * the transfer will eventually time out.
	 */
	if (LL_I2C_IsActiveFlag_BERR(i2c)) {
		LL_I2C_ClearFlag_BERR(i2c);
#if defined(CONFIG_I2C_TARGET)
		if (!data->controller_active) {
			if (error_cb != NULL) {
				error_cb(data->target_cfg, I2C_ERROR_GENERIC);
			}
			goto end;
		}
#endif
	}

#if defined(CONFIG_SMBUS_STM32_SMBALERT)
	if (LL_I2C_IsActiveSMBusFlag_ALERT(i2c)) {
		LL_I2C_ClearSMBusFlag_ALERT(i2c);
		if (data->smbalert_cb_func != NULL) {
			data->smbalert_cb_func(data->smbalert_cb_dev);
		}
		goto end;
	}
#endif

