zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_v2.c
	return 0;
end:
#if defined(CONFIG_I2C_TARGET)
	if (data->target_attached && !data->controller_active) {
		return -EIO;
	}
#endif
	i2c_stm32_disable_transfer_interrupts(dev);
	/* Wakeup thread */
	i2c_stm32_signal_xfer_done(dev);
	return -EIO;
}

static int stm32_i2c_irq_msg_finish(const struct device *dev, struct i2c_msg *msg)
{
	struct i2c_stm32_data *data = dev->data;
	const struct i2c_stm32_config *cfg = dev->config;
	bool keep_enabled = (msg->flags & I2C_MSG_STOP) == 0U;
	bool disable_i2c;
	int ret;

	/* Wait for IRQ to complete or timeout */
	ret = k_sem_take(&data->device_sync_sem, cfg->transfer_timeout);

#ifdef CONFIG_I2C_STM32_V2_DMA
	if (using_dma(data)) {
		/* Stop DMA and invalidate cache if needed */
		dma_finish(dev, msg);
	}
#endif

	/* Check for transfer errors or timeout */
	if (data->current.is_nack || data->current.is_arlo || (ret != 0)) {

		if (data->current.is_arlo) {
			LOG_DBG("ARLO");
		}

		if (data->current.is_nack) {
			LOG_DBG("NACK");
		}

		if (data->current.is_err) {
			LOG_DBG("ERR %d", data->current.is_err);
		}

		if (ret != 0) {
			LOG_DBG("TIMEOUT");
		}
		ret = -EIO;
	}

#if defined(CONFIG_I2C_TARGET)
	if (!keep_enabled || (ret != 0)) {
		data->controller_active = false;
	}
#endif

	disable_i2c = !keep_enabled || (ret != 0);
#if defined(CONFIG_I2C_TARGET)
	if (data->target_attached) {
		disable_i2c = false;
	}
#endif
	if (data->smbalert_active) {
		disable_i2c = false;
	}

	/* If I2C no longer need to be enabled and no other mode keeps it alive */
	if (disable_i2c) {
		LL_I2C_Disable(cfg->i2c);
	}

	return ret;
}

static int i2c_stm32_irq_prepare_start(const struct device *dev, struct i2c_msg *msg, uint32_t isr,
				       I2C_TypeDef *regs, uint32_t *cr2,
				       bool starting_controller_session)
{
	struct i2c_stm32_data *data = dev->data;

#if !defined(CONFIG_I2C_TARGET)
	ARG_UNUSED(starting_controller_session);
#endif

	if ((isr & I2C_ISR_TCR) != 0U) {
		return 0;
	}

#if defined(CONFIG_I2C_TARGET)
	if (starting_controller_session && data->target_attached &&
	    (wait_bus_idle(dev, CONFIG_I2C_STM32_WAIT_BUS_IDLE_TIMEOUT_USEC) != 0)) {
		data->current.msg = NULL;
		return -EBUSY;
	}
#endif

	/* As TCR is not set, expect TC to be set or that this is a (re)start message
	 * - msg->flags contains I2C_MSG_RESTART (for first start) or
	 * - TC in ISR register is set which happens when IRQ handler
	 *   has finalized its transfer and is waiting for restart
	 * For both cases, a new start condition shall be sent
	 */
	__ASSERT_NO_MSG(((isr & I2C_ISR_TC) != 0U) || ((msg->flags & I2C_MSG_RESTART) != 0U));

	if ((msg->flags & I2C_MSG_RW_MASK) == I2C_MSG_WRITE) {
		*cr2 &= ~I2C_CR2_RD_WRN;

		/* If using DMA, prepare first byte in TX buffer before transfer start as a
		 * workaround for errata: "Transmission stalled after first byte transfer"
		 */
		if (using_dma(data) && data->current.len > 0U) {
			LL_I2C_TransmitData8(regs, *data->current.buf);
			data->current.len--;
			data->current.buf++;
		}
	} else {
		*cr2 |= I2C_CR2_RD_WRN;
	}

	/* Issue (re)start condition */
	*cr2 |= I2C_CR2_START;

	return 0;
}

#ifdef CONFIG_I2C_STM32_V2_DMA
static int i2c_stm32_irq_start_dma(const struct device *dev, struct i2c_msg *msg, I2C_TypeDef *regs)
{
	struct i2c_stm32_data *data = dev->data;

	if (dma_xfer_start(dev, msg) == 0) {
		return 0;
	}

#if defined(CONFIG_I2C_TARGET)
	data->controller_active = false;
	if (!data->target_attached && !data->smbalert_active) {
		LL_I2C_Disable(regs);
	}
#else
	if (!data->smbalert_active) {
		LL_I2C_Disable(regs);
	}
#endif
	data->current.msg = NULL;

	return -EIO;
}
#endif

static int stm32_i2c_irq_xfer(const struct device *dev, struct i2c_msg *msg,
			      uint8_t *next_msg_flags, uint16_t target)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *regs = cfg->i2c;
	int ret;
	bool starting_controller_session = false;

#if defined(CONFIG_I2C_TARGET)
	starting_controller_session = !data->controller_active;
#endif

	/* Drop stale completion token from a previous transfer before arming a new one. */
	k_sem_reset(&data->device_sync_sem);

	data->current.len = msg->len;
	data->current.buf = msg->buf;
	data->current.is_arlo = 0U;
	data->current.is_nack = 0U;
	data->current.is_err = 0U;
	data->current.msg = msg;

#if defined(CONFIG_I2C_STM32_V2_DMA)
	/* i2c_stm32_xfer_will_use_dma() flushes cache on write message if needed */
	data->use_dma = i2c_stm32_xfer_will_use_dma(cfg, msg->buf, msg->len,
						    (msg->flags & I2C_MSG_RW_MASK) ==
						    I2C_MSG_WRITE);
#endif /* CONFIG_I2C_STM32_V2_DMA */

	/* Flush TX register */
	LL_I2C_ClearFlag_TXE(regs);

	/* Enable I2C peripheral if not already done */
	LL_I2C_Enable(regs);

	uint32_t cr2 = stm32_reg_read(&regs->CR2);
	uint32_t isr = stm32_reg_read(&regs->ISR);

	/* Clear fields in CR2 which will be filled in later in function */
	cr2 &= ~(I2C_CR2_RELOAD | I2C_CR2_AUTOEND | I2C_CR2_NBYTES_Msk | I2C_CR2_SADD_Msk |
		I2C_CR2_ADD10);

	if ((I2C_ADDR_10_BITS & data->dev_config) != 0U) {
		cr2 |= (uint32_t)target | I2C_CR2_ADD10;
	} else {
		cr2 |= (uint32_t)target << 1;
	}

	/* If this is not a stop message and more messages follow without change of direction,
	 * reload mode must be used during this transaction
	 * also a helper variable is set to inform IRQ handler about that it should
	 * keep reload mode turned on ready for next message
	 */
	if (((msg->flags & I2C_MSG_STOP) == 0U) && (next_msg_flags != NULL) &&
	    ((*next_msg_flags & I2C_MSG_RESTART) == 0U)) {
		cr2 |= I2C_CR2_RELOAD;
		data->current.continue_in_next = true;
	} else {
		data->current.continue_in_next = false;
	}

	/* For messages larger than 255 bytes, transactions must be split in chunks
	 * Use reload mode and let IRQ handler take care of jumping to next chunk
	 */
	if (msg->len > 255U) {
		cr2 |= (255U << I2C_CR2_NBYTES_Pos) | I2C_CR2_RELOAD;
	} else {
		/* Whole message can be sent in one I2C HW transaction */
		cr2 |= msg->len << I2C_CR2_NBYTES_Pos;
	}

	/* If a reload mode transfer is pending since last message then skip
	 * checking for transfer complete or restart flag in message
	 * Reload transfer will start right after writing new length
	 * to CR2 below
	 */
	ret = i2c_stm32_irq_prepare_start(dev, msg, isr, regs, &cr2, starting_controller_session);
	if (ret != 0) {
		return ret;
	}

	/* Set common interrupt enable bits */
	uint32_t cr1 = I2C_CR1_ERRIE | I2C_CR1_STOPIE | I2C_CR1_TCIE | I2C_CR1_NACKIE;

	if (using_dma(data)) {
#ifdef CONFIG_I2C_STM32_V2_DMA
		ret = i2c_stm32_irq_start_dma(dev, msg, regs);
		if (ret != 0) {
			return ret;
		}
#endif /* CONFIG_I2C_STM32_V2_DMA */
	} else {
		/* If not using DMA, also enable RX and TX empty interrupts */
		cr1 |= I2C_CR1_TXIE | I2C_CR1_RXIE;
	}

#if defined(CONFIG_I2C_TARGET)
	if (starting_controller_session) {
		data->controller_active = true;
	}
#endif

