zephyrproject-rtos/zephyr/drivers/i2c/i2c_stm32_v2.c
	for (uint32_t count = 0; count < I2C_STM32_VALID_TIMING_NBR; count++) {
		/* tPRESC = (PRESC+1) x tI2CCLK*/
		uint32_t tpresc = (i2c_valid_timing[count].presc + 1U) * ti2cclk;

		for (scll = 0; scll < I2C_STM32_SCLL_MAX; scll++) {
			/* tLOW(min) <= tAF(min) + tDNF + 2 x tI2CCLK + [(SCLL+1) x tPRESC ] */
			uint32_t tscl_l = tafdel_min + dnf_delay +
				(2U * ti2cclk) + ((scll + 1U) * tpresc);

			/*
			 * The I2CCLK period tI2CCLK must respect the following conditions:
			 * tI2CCLK < (tLOW - tfilters) / 4 and tI2CCLK < tHIGH
			 */
			if ((tscl_l > i2c_stm32_charac[i2c_speed].lscl_min) &&
			    (ti2cclk < ((tscl_l - tafdel_min - dnf_delay) / 4U))) {
				for (sclh = 0; sclh < I2C_STM32_SCLH_MAX; sclh++) {
					/*
					 * tHIGH(min) <= tAF(min) + tDNF +
					 * 2 x tI2CCLK + [(SCLH+1) x tPRESC]
					 */
					uint32_t tscl_h = tafdel_min + dnf_delay +
						(2U * ti2cclk) + ((sclh + 1U) * tpresc);

					/* tSCL = tf + tLOW + tr + tHIGH */
					uint32_t tscl = tscl_l +
						tscl_h + i2c_stm32_charac[i2c_speed].trise +
						i2c_stm32_charac[i2c_speed].tfall;

					/* get timings with the lowest clock error */
					I2C_LOOP_SCLH();
				}
			}
		}
	}

	return ret;
}

/*
 * Macro used to fix the compliance check warning :
 * "DEEP_INDENTATION: Too many leading tabs - consider code refactoring
 * in the i2c_compute_presc_scldel_sdadel() function below
 */
#define I2C_LOOP_SDADEL()								\
	if ((tsdadel >= (uint32_t)tsdadel_min) &&					\
	    (tsdadel <= (uint32_t)tsdadel_max)) {					\
		if (presc != prev_presc) {						\
			i2c_valid_timing[i2c_valid_timing_nbr].presc = presc;		\
			i2c_valid_timing[i2c_valid_timing_nbr].tscldel = scldel;	\
			i2c_valid_timing[i2c_valid_timing_nbr].tsdadel = sdadel;	\
			prev_presc = presc;						\
			i2c_valid_timing_nbr++;						\
											\
			if (i2c_valid_timing_nbr >= I2C_STM32_VALID_TIMING_NBR) {	\
				break;							\
			}								\
		}									\
	}

/*
 * @brief  Compute PRESC, SCLDEL and SDADEL.
 * @param  clock_src_freq I2C source clock in Hz.
 * @param  i2c_speed I2C frequency (index).
 * @retval None.
 */
void i2c_compute_presc_scldel_sdadel(uint32_t clock_src_freq, uint32_t i2c_speed)
{
	uint32_t prev_presc = I2C_STM32_PRESC_MAX;
	uint32_t ti2cclk;
	int32_t tsdadel_min, tsdadel_max;
	int32_t tscldel_min;
	uint32_t presc, scldel, sdadel;
	uint32_t tafdel_min, tafdel_max;

	ti2cclk = (NSEC_PER_SEC + (clock_src_freq / 2U)) / clock_src_freq;

	tafdel_min = (I2C_STM32_USE_ANALOG_FILTER == 1U) ?
		I2C_STM32_ANALOG_FILTER_DELAY_MIN : 0U;
	tafdel_max = (I2C_STM32_USE_ANALOG_FILTER == 1U) ?
		I2C_STM32_ANALOG_FILTER_DELAY_MAX : 0U;
	/*
	 * tDNF = DNF x tI2CCLK
	 * tPRESC = (PRESC+1) x tI2CCLK
	 * SDADEL >= {tf +tHD;DAT(min) - tAF(min) - tDNF - [3 x tI2CCLK]} / {tPRESC}
	 * SDADEL <= {tVD;DAT(max) - tr - tAF(max) - tDNF- [4 x tI2CCLK]} / {tPRESC}
	 */
	tsdadel_min = (int32_t)i2c_stm32_charac[i2c_speed].tfall +
		(int32_t)i2c_stm32_charac[i2c_speed].hddat_min -
		(int32_t)tafdel_min -
		(int32_t)(((int32_t)i2c_stm32_charac[i2c_speed].dnf + 3) *
		(int32_t)ti2cclk);

	tsdadel_max = (int32_t)i2c_stm32_charac[i2c_speed].vddat_max -
		(int32_t)i2c_stm32_charac[i2c_speed].trise -
		(int32_t)tafdel_max -
		(int32_t)(((int32_t)i2c_stm32_charac[i2c_speed].dnf + 4) *
		(int32_t)ti2cclk);

	/* {[tr+ tSU;DAT(min)] / [tPRESC]} - 1 <= SCLDEL */
	tscldel_min = (int32_t)i2c_stm32_charac[i2c_speed].trise +
		(int32_t)i2c_stm32_charac[i2c_speed].sudat_min;

	if (tsdadel_min <= 0) {
		tsdadel_min = 0;
	}

	if (tsdadel_max <= 0) {
		tsdadel_max = 0;
	}

	for (presc = 0; presc < I2C_STM32_PRESC_MAX; presc++) {
		for (scldel = 0; scldel < I2C_STM32_SCLDEL_MAX; scldel++) {
			/* TSCLDEL = (SCLDEL+1) * (PRESC+1) * TI2CCLK */
			uint32_t tscldel = (scldel + 1U) * (presc + 1U) * ti2cclk;

			if (tscldel >= (uint32_t)tscldel_min) {
				for (sdadel = 0; sdadel < I2C_STM32_SDADEL_MAX; sdadel++) {
					/* TSDADEL = SDADEL * (PRESC+1) * TI2CCLK */
					uint32_t tsdadel = (sdadel * (presc + 1U)) * ti2cclk;

					I2C_LOOP_SDADEL();
				}

				if (i2c_valid_timing_nbr >= I2C_STM32_VALID_TIMING_NBR) {
					return;
				}
			}
		}
	}
}

int i2c_stm32_configure_timing(const struct device *dev, uint32_t clock)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t timing = 0U;
	uint32_t idx;
	uint32_t speed = 0U;
	uint32_t i2c_freq;

	switch (I2C_SPEED_GET(data->dev_config)) {
	case I2C_SPEED_DT:
		i2c_freq = cfg->bitrate;
		break;
	case I2C_SPEED_STANDARD:
		i2c_freq = I2C_BITRATE_STANDARD;
		break;
	case I2C_SPEED_FAST:
		i2c_freq = I2C_BITRATE_FAST;
		break;
	case I2C_SPEED_FAST_PLUS:
		i2c_freq = I2C_BITRATE_FAST_PLUS;
		break;
	default:
		LOG_ERR("i2c: speed ID %u (I2C_SPEED_*) not supported",
			I2C_SPEED_GET(data->dev_config));
		return -EINVAL;
	}

	/* Reset valid timing count at the beginning of each new computation */
	i2c_valid_timing_nbr = 0;

	if ((clock != 0U) && (i2c_freq != 0U)) {
		for (speed = 0; speed <= (uint32_t)I2C_STM32_SPEED_FREQ_FAST_PLUS; speed++) {
			if ((i2c_freq >= i2c_stm32_charac[speed].freq_min) &&
			    (i2c_freq <= i2c_stm32_charac[speed].freq_max)) {
				i2c_compute_presc_scldel_sdadel(clock, speed);
				idx = i2c_compute_scll_sclh(clock, speed);
				if (idx < I2C_STM32_VALID_TIMING_NBR) {
					timing = ((i2c_valid_timing[idx].presc &
						  0x0FU) << 28) |
						 ((i2c_valid_timing[idx].tscldel & 0x0FU) << 20) |
						 ((i2c_valid_timing[idx].tsdadel & 0x0FU) << 16) |
						 ((i2c_valid_timing[idx].sclh & 0xFFU) << 8) |
						 ((i2c_valid_timing[idx].scll & 0xFFU) << 0);
				}
				break;
			}
		}
	}

	/* Fill the current timing value in data structure at runtime */
	data->current_timing.periph_clock = clock;
	data->current_timing.i2c_speed = i2c_freq;
	data->current_timing.timing_setting = timing;

	LL_I2C_SetTiming(i2c, timing);

	return 0;
}
#else /* CONFIG_I2C_STM32_V2_TIMING */

int i2c_stm32_configure_timing(const struct device *dev, uint32_t clock)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;
	uint32_t i2c_hold_time_min, i2c_setup_time_min;
	uint32_t i2c_h_min_time, i2c_l_min_time;
	uint32_t presc = 1U;
	uint32_t timing = 0U;

